import React from "react";
import { Wrapper } from "./styles";

const agreement: React.FC = () => {
  return (
    <Wrapper>
      <div className="agreement">
        <h2 className="agreement__title">Пользовательское соглашение</h2>
        <p className="agreement__text">
          Публичная Оферта 1. Основные положения. 1.1. Данная Оферта является
          Договором интернет-магазина “Teolodomshop.com” по отношению к
          физическим и юридическим лицам. 1.2. На основании ГК Республики
          Узбекистан, а также законодательного акта “Об электронном
          документообороте” выполняется реализация товаров в форме Договора.
          1.3. Данный Договор является публичным и единым для всех покупателей
          вне зависимости от их налогового положения. 2. Предмет договора. 2.1.
          Продавец берет на себя обязанность реализовывать товар Покупателю,
          который, в свою очередь, обязывается оплатить и получить его на
          условиях, прописанных в Оферте. 2.2. Договор регулирует покупку и
          продажу товара в интернет-магазине “ikarvon.uz”: – добровольный выбор;
          – оформление заказа и оплату; – обработку заказа и его доставку
          Покупателю. 3. Момент заключения договора. 3.1. Моментом заключения
          договора принято считать момент оплаты товара по условиям, указанным в
          данной Оферте. 4. Характеристики товара. 4.1. Факт заказа товара на
          сайте означает, что Покупатель согласен с данной Офертой. 4.2.
          Продавец обязан публиковать Покупателю действительную и комплексную
          информацию о товаре. 4.3. Информация о товаре должна включать место
          изготовления, длительность гарантии, потребительские характеристики и
          срок годности. 5. Цена товара. 5.1. Цена каждого товара указана на
          сайте по следующему адресу “ikarvon.uz”. 5.2. Цена товара указывается
          в валюте Узбекистана — сум. 6. Условия оплаты и доставки. 6.1. Оплата
          товара осуществляется наличными или посредством денежного перевода на
          карту Продавца. 6.2. Покупатель обязан совершить оплату в
          согласованные с Продавцом сроки. 6.3. Сроки доставки товара
          устанавливаются Сторонами, дата поставки фиксируется в накладных. 6.4.
          Доставка по Узбекистану происходит в будни с 10 до 18. 6.5. Доставка
          товара Покупателю может осуществляться: – бесплатно при заказе на
          сумму свыше 1 млн. сум; – по стандартным расценкам вне зависимости от
          суммы товара на протяжении суток; – в регионы на протяжении 3 суток.
          7. Гарантии на продукцию. 7.1. Любая информация о товаре, которая
          содержится на сайте “ikarvon.uz”, носит информационный характер. 7.2.
          Для уточнения характеристик товара нужно обратиться за помощью к
          консультанту. 7.3. Продавец обязуется указывать достоверные
          характеристики товара, гарантировать его целостность при доставке. 8.
          Возврат и обмен товара. 8.1. Покупатель может вернуть или обменять
          товар, если он не подошёл по габаритным размерам и другим техническим
          характеристикам, в течение 10 дней. 8.2. Возврат возможен при условии
          сохранения товарного вида продукции. 9. Сбор и хранение персональных
          данных. 9.1. Покупатель дает согласие на SMS рассылку в тот момент,
          когда звонит в колл-центр или проходит регистрацию на сайте. 10. Отказ
          от СМС рассылки. 10.1. В случае необходимости отказа от SMS-рассылки
          Покупатель обязуется указать это в специальном поле при регистрации
          или сообщить менеджеру в процессе звонка. 11. Изменение Оферты. 11.1
          Администрация сайта может менять правила Публичной Оферты без
          уведомления Покупателя. 11.2. Изменения вступают в силу в течение 10
          дней с момента публикации на сайте. 11.3. Рекомендуем регулярно читать
          Публичную Оферту для полного понимания условий Договора. 12.
          Форс-мажорные обстоятельства. 12.1. Выполнение обязательств Сторон
          может быть приостановлено при наступлении форс-мажорных обстоятельств:
          изменений законодательства, стихийных бедствии, вооруженного
          конфликта. 12.2. Сторона, потерпевшая от форс-мажоров, обязуется в
          течение 5 дней уведомить об этом вторую Сторону. 12.3. Потерпевшая
          сторона освобождается от ответственности по Договору на период
          действия данных обстоятельств. 13. Приложения. 13.1. Договор считается
          действующим с момента получения положительного ответа Стороной,
          предложившей данный Договор, от второй Стороны. 13.2. Договор может
          быть изменен по согласию Сторон.
        </p>
      </div>
    </Wrapper>
  );
};

export default agreement;
